Tekla.Structures.Model.ControlArc
The ControlArc class defines a user defined arc helping in modeling work.

Tekla.Structures.Model.ControlArc.geometry
Contains the internal arc geometry

Tekla.Structures.Model.ControlArc.Color
Gets or sets color of the control arc.

Tekla.Structures.Model.ControlArc.LineType
The line type of the control arc.

Tekla.Structures.Model.ControlArc.Geometry
Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be
less than 360 degrees).
Throws System.ArgumentException: Thrown if the input arc is a complete circle"

Tekla.Structures.Model.ControlArc.#ctor
Creates a new control arc instance.
The default values are as follows:
CenterPoint = Point(0.0, 0.0, 0.0);
StartPoint = Point(0.0, 1000.0, 0.0);
EndPoint = Point(1000.0, 0.0, 0.0);
Color = ControlObjectColorEnum.YELLOW;

Tekla.Structures.Model.ControlArc.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new control arc instance taking the 3 points.
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point that defines the arc.
Throws System.ArgumentException: Throws when input points are not defined correctly

Tekla.Structures.Model.ControlArc.Delete
Deletes the control arc with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.Insert
Inserts the control arc into the model.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.Modify
Modifies the control arc with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.Select
Selects the control arc with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.CreateInstance
Method for creation of the object.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.SelectInstance
Method for selection of the object.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.ModifyInstance
Method for modifying the object.
Returns: True on success, false otherwise.

Tekla.Structures.Model.ControlArc.ToStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from dotNet to core.
PlaneStruct: Struct containing the arc data

Tekla.Structures.Model.ControlArc.FromStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from core to dotNet.
PlaneStruct: Struct containing the arc data